[Killed] BlockStatement
PersonalProjects/mars-rover-kata/src/rover.js:5:51
   #position;
   #direction;
 
-  constructor(position = [1, 1], direction = "N") {
-    this.#position = position;
-    this.#direction = direction;
-  }
+  constructor(position = [1, 1], direction = "N") {}
 
   #MOVE_FORWARD_ACTIONS = {
killedBy: Mars Rover Tests has a start position of 1,1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 1]
Received: undefined

[Killed] ArithmeticOperator
PersonalProjects/mars-rover-kata/src/rover.js:11:35
   }
 
   #MOVE_FORWARD_ACTIONS = {
-    N: () => (this.#position[1] = this.#position[1] + 1),
+    N: () => (this.#position[1] = this.#position[1] - 1),
     S: () => (this.#position[1] = this.#position[1] - 1),
     E: () => (this.#position[0] = this.#position[0] + 1),
killedBy: Mars Rover Tests moves forward by 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:11:8
   }
 
   #MOVE_FORWARD_ACTIONS = {
-    N: () => (this.#position[1] = this.#position[1] + 1),
+    N: () => undefined,
     S: () => (this.#position[1] = this.#position[1] - 1),
     E: () => (this.#position[0] = this.#position[0] + 1),
killedBy: Mars Rover Tests moves forward by 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:12:8
 
   #MOVE_FORWARD_ACTIONS = {
     N: () => (this.#position[1] = this.#position[1] + 1),
-    S: () => (this.#position[1] = this.#position[1] - 1),
+    S: () => undefined,
     E: () => (this.#position[0] = this.#position[0] + 1),
     W: () => (this.#position[0] = this.#position[0] - 1),
killedBy: Mars Rover Tests moves forward by 1 facing south
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   3,

[Killed] ArithmeticOperator
PersonalProjects/mars-rover-kata/src/rover.js:12:35
 
   #MOVE_FORWARD_ACTIONS = {
     N: () => (this.#position[1] = this.#position[1] + 1),
-    S: () => (this.#position[1] = this.#position[1] - 1),
+    S: () => (this.#position[1] = this.#position[1] + 1),
     E: () => (this.#position[0] = this.#position[0] + 1),
     W: () => (this.#position[0] = this.#position[0] - 1),
killedBy: Mars Rover Tests moves forward by 1 facing south
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   3,

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:13:8
   #MOVE_FORWARD_ACTIONS = {
     N: () => (this.#position[1] = this.#position[1] + 1),
     S: () => (this.#position[1] = this.#position[1] - 1),
-    E: () => (this.#position[0] = this.#position[0] + 1),
+    E: () => undefined,
     W: () => (this.#position[0] = this.#position[0] - 1),
   };
killedBy: Mars Rover Tests moves forward by 1 facing east
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   1,

[Killed] ArithmeticOperator
PersonalProjects/mars-rover-kata/src/rover.js:13:35
   #MOVE_FORWARD_ACTIONS = {
     N: () => (this.#position[1] = this.#position[1] + 1),
     S: () => (this.#position[1] = this.#position[1] - 1),
-    E: () => (this.#position[0] = this.#position[0] + 1),
+    E: () => (this.#position[0] = this.#position[0] - 1),
     W: () => (this.#position[0] = this.#position[0] - 1),
   };
killedBy: Mars Rover Tests moves forward by 1 facing east
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   0,

[Killed] ArithmeticOperator
PersonalProjects/mars-rover-kata/src/rover.js:14:35
     N: () => (this.#position[1] = this.#position[1] + 1),
     S: () => (this.#position[1] = this.#position[1] - 1),
     E: () => (this.#position[0] = this.#position[0] + 1),
-    W: () => (this.#position[0] = this.#position[0] - 1),
+    W: () => (this.#position[0] = this.#position[0] + 1),
   };
 
killedBy: Mars Rover Tests moves forward by 1 facing west
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   5,

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:14:8
     N: () => (this.#position[1] = this.#position[1] + 1),
     S: () => (this.#position[1] = this.#position[1] - 1),
     E: () => (this.#position[0] = this.#position[0] + 1),
-    W: () => (this.#position[0] = this.#position[0] - 1),
+    W: () => undefined,
   };
 
killedBy: Mars Rover Tests moves forward by 1 facing west
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   4,

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:18:8
   };
 
   #MOVE_BACKWARDS_ACTIONS = {
-    N: () => (this.#position[1] = this.#position[1] - 1),
+    N: () => undefined,
     S: () => (this.#position[1] = this.#position[1] + 1),
     E: () => (this.#position[0] = this.#position[0] - 1),
killedBy: Mars Rover Tests moves backwards by 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   1,

[Killed] ArithmeticOperator
PersonalProjects/mars-rover-kata/src/rover.js:18:35
   };
 
   #MOVE_BACKWARDS_ACTIONS = {
-    N: () => (this.#position[1] = this.#position[1] - 1),
+    N: () => (this.#position[1] = this.#position[1] + 1),
     S: () => (this.#position[1] = this.#position[1] + 1),
     E: () => (this.#position[0] = this.#position[0] - 1),
killedBy: Mars Rover Tests moves backwards by 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   1,

[Killed] ArithmeticOperator
PersonalProjects/mars-rover-kata/src/rover.js:19:35
 
   #MOVE_BACKWARDS_ACTIONS = {
     N: () => (this.#position[1] = this.#position[1] - 1),
-    S: () => (this.#position[1] = this.#position[1] + 1),
+    S: () => (this.#position[1] = this.#position[1] - 1),
     E: () => (this.#position[0] = this.#position[0] - 1),
     W: () => (this.#position[0] = this.#position[0] + 1),
killedBy: Mars Rover Tests moved backwards by 1 facing south
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    2,
-   5,

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:19:8
 
   #MOVE_BACKWARDS_ACTIONS = {
     N: () => (this.#position[1] = this.#position[1] - 1),
-    S: () => (this.#position[1] = this.#position[1] + 1),
+    S: () => undefined,
     E: () => (this.#position[0] = this.#position[0] - 1),
     W: () => (this.#position[0] = this.#position[0] + 1),
killedBy: Mars Rover Tests moved backwards by 1 facing south
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    2,
-   5,

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:20:8
   #MOVE_BACKWARDS_ACTIONS = {
     N: () => (this.#position[1] = this.#position[1] - 1),
     S: () => (this.#position[1] = this.#position[1] + 1),
-    E: () => (this.#position[0] = this.#position[0] - 1),
+    E: () => undefined,
     W: () => (this.#position[0] = this.#position[0] + 1),
   };
killedBy: Mars Rover Tests moved backwards by 1 facing east
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   2,

[Killed] ArithmeticOperator
PersonalProjects/mars-rover-kata/src/rover.js:20:35
   #MOVE_BACKWARDS_ACTIONS = {
     N: () => (this.#position[1] = this.#position[1] - 1),
     S: () => (this.#position[1] = this.#position[1] + 1),
-    E: () => (this.#position[0] = this.#position[0] - 1),
+    E: () => (this.#position[0] = this.#position[0] + 1),
     W: () => (this.#position[0] = this.#position[0] + 1),
   };
killedBy: Mars Rover Tests moved backwards by 1 facing east
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   3,

[Killed] ArithmeticOperator
PersonalProjects/mars-rover-kata/src/rover.js:21:35
     N: () => (this.#position[1] = this.#position[1] - 1),
     S: () => (this.#position[1] = this.#position[1] + 1),
     E: () => (this.#position[0] = this.#position[0] - 1),
-    W: () => (this.#position[0] = this.#position[0] + 1),
+    W: () => (this.#position[0] = this.#position[0] - 1),
   };
 
killedBy: Mars Rover Tests moved backwards by 1 facing west
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   4,
+   2,

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:21:8
     N: () => (this.#position[1] = this.#position[1] - 1),
     S: () => (this.#position[1] = this.#position[1] + 1),
     E: () => (this.#position[0] = this.#position[0] - 1),
-    W: () => (this.#position[0] = this.#position[0] + 1),
+    W: () => undefined,
   };
 
killedBy: Mars Rover Tests moved backwards by 1 facing west
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   4,
+   3,

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:25:8
   };
 
   #TURN_RIGHT_ACTIONS = {
-    N: () => (this.#direction = "E"),
+    N: () => undefined,
     S: () => (this.#direction = "W"),
     E: () => (this.#direction = "S"),
killedBy: Mars Rover Tests turns right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "E"
Received: "N"

[Killed] StringLiteral
PersonalProjects/mars-rover-kata/src/rover.js:25:33
   };
 
   #TURN_RIGHT_ACTIONS = {
-    N: () => (this.#direction = "E"),
+    N: () => (this.#direction = ""),
     S: () => (this.#direction = "W"),
     E: () => (this.#direction = "S"),
killedBy: Mars Rover Tests turns right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "E"
Received: ""

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:26:8
 
   #TURN_RIGHT_ACTIONS = {
     N: () => (this.#direction = "E"),
-    S: () => (this.#direction = "W"),
+    S: () => undefined,
     E: () => (this.#direction = "S"),
     W: () => (this.#direction = "N"),
killedBy: Mars Rover Tests turns right when facing south
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "W"
Received: "S"

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:27:8
   #TURN_RIGHT_ACTIONS = {
     N: () => (this.#direction = "E"),
     S: () => (this.#direction = "W"),
-    E: () => (this.#direction = "S"),
+    E: () => undefined,
     W: () => (this.#direction = "N"),
   };
killedBy: Mars Rover Tests turns right when facing east
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "S"
Received: "E"

[Killed] StringLiteral
PersonalProjects/mars-rover-kata/src/rover.js:27:33
   #TURN_RIGHT_ACTIONS = {
     N: () => (this.#direction = "E"),
     S: () => (this.#direction = "W"),
-    E: () => (this.#direction = "S"),
+    E: () => (this.#direction = ""),
     W: () => (this.#direction = "N"),
   };
killedBy: Mars Rover Tests turns right when facing east
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "S"
Received: ""

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:28:8
     N: () => (this.#direction = "E"),
     S: () => (this.#direction = "W"),
     E: () => (this.#direction = "S"),
-    W: () => (this.#direction = "N"),
+    W: () => undefined,
   };
 
killedBy: Mars Rover Tests turns right when facing west
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "N"
Received: "W"

[Killed] ObjectLiteral
PersonalProjects/mars-rover-kata/src/rover.js:31:24
     W: () => (this.#direction = "N"),
   };
 
-  #TURN_LEFT_ACTIONS = {
-    N: () => (this.#direction = "W"),
-    S: () => (this.#direction = "E"),
-    E: () => (this.#direction = "N"),
-    W: () => (this.#direction = "S"),
-  };
+  #TURN_LEFT_ACTIONS = {};
 
   get position() {
killedBy: Mars Rover Tests turns left
statusReason: TypeError: this[#TURN_LEFT_ACTIONS][this[#direction]] is not a function

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:32:8
   };
 
   #TURN_LEFT_ACTIONS = {
-    N: () => (this.#direction = "W"),
+    N: () => undefined,
     S: () => (this.#direction = "E"),
     E: () => (this.#direction = "N"),
killedBy: Mars Rover Tests turns left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "W"
Received: "N"

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:33:8
 
   #TURN_LEFT_ACTIONS = {
     N: () => (this.#direction = "W"),
-    S: () => (this.#direction = "E"),
+    S: () => undefined,
     E: () => (this.#direction = "N"),
     W: () => (this.#direction = "S"),
killedBy: Mars Rover Tests turns left when facing S
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "E"
Received: "S"

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:34:8
   #TURN_LEFT_ACTIONS = {
     N: () => (this.#direction = "W"),
     S: () => (this.#direction = "E"),
-    E: () => (this.#direction = "N"),
+    E: () => undefined,
     W: () => (this.#direction = "S"),
   };
killedBy: Mars Rover Tests turns left when facing E
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "N"
Received: "E"

[Killed] ArrowFunction
PersonalProjects/mars-rover-kata/src/rover.js:35:8
     N: () => (this.#direction = "W"),
     S: () => (this.#direction = "E"),
     E: () => (this.#direction = "N"),
-    W: () => (this.#direction = "S"),
+    W: () => undefined,
   };
 
killedBy: Mars Rover Tests turns left when facing W
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "S"
Received: "W"

[Killed] BlockStatement
PersonalProjects/mars-rover-kata/src/rover.js:38:18
     W: () => (this.#direction = "S"),
   };
 
-  get position() {
-    return this.#position;
-  }
+  get position() {}
 
   get direction() {
killedBy: Mars Rover Tests has a start position of 1,1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 1]
Received: undefined

[Killed] BlockStatement
PersonalProjects/mars-rover-kata/src/rover.js:42:19
     return this.#position;
   }
 
-  get direction() {
-    return this.#direction;
-  }
+  get direction() {}
 
   moveForward() {
killedBy: Mars Rover Tests has a start direction of north
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "N"
Received: undefined

[Killed] BlockStatement
PersonalProjects/mars-rover-kata/src/rover.js:46:17
     return this.#direction;
   }
 
-  moveForward() {
-    this.#MOVE_FORWARD_ACTIONS[this.#direction]();
-  }
+  moveForward() {}
 
   moveBackwards() {
killedBy: Mars Rover Tests moves forward by 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] BlockStatement
PersonalProjects/mars-rover-kata/src/rover.js:50:19
     this.#MOVE_FORWARD_ACTIONS[this.#direction]();
   }
 
-  moveBackwards() {
-    this.#MOVE_BACKWARDS_ACTIONS[this.#direction]();
-  }
+  moveBackwards() {}
 
   turnRight() {
killedBy: Mars Rover Tests moves backwards by 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   1,

[Killed] BlockStatement
PersonalProjects/mars-rover-kata/src/rover.js:54:15
     this.#MOVE_BACKWARDS_ACTIONS[this.#direction]();
   }
 
-  turnRight() {
-    this.#TURN_RIGHT_ACTIONS[this.#direction]();
-  }
+  turnRight() {}
 
   turnLeft() {
killedBy: Mars Rover Tests turns right
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "E"
Received: "N"

[Killed] BlockStatement
PersonalProjects/mars-rover-kata/src/rover.js:58:14
     this.#TURN_RIGHT_ACTIONS[this.#direction]();
   }
 
-  turnLeft() {
-    this.#TURN_LEFT_ACTIONS[this.#direction]();
-  }
+  turnLeft() {}
 }
 
killedBy: Mars Rover Tests turns left
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "W"
Received: "N"
